tap "azure/azure-workload-identity"
tap "azure/kubelogin"
tap "databricks/tap"
tap "fluxcd/tap"
tap "grafana/grafana"
tap "hivemq/mqtt-cli"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "olets/tap"
tap "powershell/tap"
tap "snyk/tap"
brew "libyaml"
brew "ansible", link: false
brew "ansible-lint"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "asciidoctor"
brew "azcopy"
brew "python@3.11"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "gmp"
brew "openblas"
brew "checkov", link: false
brew "cilium-cli"
brew "cloudflared"
brew "cmctl"
brew "coreutils"
brew "diff-so-fancy"
brew "docutils"
brew "dos2unix"
brew "exa"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "fonttools"
brew "fzf"
brew "libavif"
brew "gdk-pixbuf"
brew "openjpeg"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "glab"
brew "unbound"
brew "pinentry"
brew "gnupg"
brew "go"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "libheif"
brew "imagemagick"
brew "infracost"
brew "istioctl"
brew "jfrog-cli"
brew "jhead"
brew "jq"
brew "k3d"
brew "k9s"
brew "openjdk"
brew "zookeeper"
brew "kafka"
brew "krb5"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "lazygit"
brew "less"
brew "libpq"
brew "logcli"
brew "mas"
brew "media-info"
brew "memcached"
brew "mkcert"
brew "most"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nss"
brew "onefetch"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "pre-commit"
brew "pstree"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "scw"
brew "shellcheck"
brew "spaceship"
brew "ssh-copy-id"
brew "starship"
brew "stern"
brew "stow"
brew "strongswan"
brew "syft"
brew "telnet"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tldr"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "w3m"
brew "wget"
brew "wireshark"
brew "yamllint"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "azure/azure-workload-identity/azwi"
brew "azure/kubelogin/kubelogin"
brew "databricks/tap/databricks"
brew "fluxcd/tap/flux"
brew "grafana/grafana/cortextool"
brew "hivemq/mqtt-cli/mqtt-cli"
brew "olets/tap/zsh-abbr"
brew "powershell/tap/powershell"
brew "snyk/tap/snyk"
cask "adoptopenjdk"
cask "bruno"
cask "cloudflare-warp"
cask "daisydisk"
cask "deepl"
cask "deluge"
cask "discord"
cask "firefox@developer-edition"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "fork"
cask "gather"
cask "istat-menus"
cask "iterm2"
cask "keepassxc"
cask "lens"
cask "mamp"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "postman"
cask "rancher"
cask "screenflick"
cask "spotify"
cask "steam"
cask "todoist"
cask "tunnelblick"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zoom"
mas "Azure VPN Client", id: 1553936137
vscode "akamud.vscode-theme-onedark"
vscode "ashinzekene.nestjs"
vscode "benjaminbenais.copilot-theme"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "pomdtr.markdown-kroki"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "znck.grammarly"
