# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"

# Homebrew
# https://github.com/Homebrew/brew/

brew "ansible"
brew "ansible-lint"
brew "asciidoctor"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cloudflared"
brew "coreutils"
brew "diff-so-fancy"
brew "docutils"
brew "dos2unix"
brew "exa"
brew "fd"
brew "fontforge"
brew "fonttools"
brew "fork"
brew "fzf"
brew "hub"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp"
brew "gpg"
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "kubectl"
brew "krew"
brew "lazygit"
brew "less"
brew "libtermkey"
brew "mas"
brew "media-info"
brew "memcached"
brew "most"
brew "neofetch"
brew "neovim"
brew "node"
brew "olets/tap/zsh-abbr"
brew "onefetch"
brew "openssl"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "pstree"
brew "python"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "stern"
brew "stow"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "w3m"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "zsh"

brew "libyaml" # should be installed after openssl

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask
#
# Critical Programs
# These are programs I usually need to install immediately on a new machine.
# For this reason, they don't do so well being managed by Homebrew.
# cask "1password"
# cask "google-chrome"
# cask "dropbox"

cask "cloudflare-warp"
cask "deepl"
cask "deluge"
cask "expressvpn"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "gather"
cask "istat-menus"
cask "iterm2"
cask "keepassxc"
cask "lens"
cask "notion"
cask "obsidian"
cask "postico"
cask "postman"
cask "screenflick"
cask "spotify"
cask "todoist"
cask "vlc"
cask "whatsapp"
cask "zoom"


# vim: set filetype=ruby: